grails-app/views/templates/input_xml/_change_pass.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:cic="http://www.endpoint.ws.h2h.cic.org.vn/cicauthen">
    <soapenv:Header/>
    <soapenv:Body>
        <cic:DoiMatKhau>
            <cic:TenDangNhap>{TenDangNhap}</cic:TenDangNhap>
            <cic:MatKhauCu>{MatKhauCu}</cic:MatKhauCu>
            <cic:MatKhauMoi>{MatKhauMoi}</cic:MatKhauMoi>
        </cic:DoiMatKhau>
    </soapenv:Body>
</soapenv:Envelope>
